app/controllers/broadcasts_controller.rb

SELECT "broadcasts".* FROM "broadcasts"
---
  def index
    @broadcasts = Broadcast.all

INSERT INTO "broadcasts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "给跪了"], ["created_at", Mon, 10 Jun 2013 03:41:29 UTC +00:00], ["updated_at", Mon, 10 Jun 2013 03:41:29 UTC +00:00]]
---
  def create
    @broadcast = Broadcast.new(broadcast_params)

    respond_to do |format|
      if @broadcast.save

DELETE FROM "broadcasts" WHERE "broadcasts"."id" = ?  [["id", 1]]
---
  def destroy
    @broadcast.destroy

SELECT "broadcasts".* FROM "broadcasts" WHERE "broadcasts"."id" = ? LIMIT 1  [["id", "12"]]
---
    def set_broadcast
      @broadcast = Broadcast.find(params[:id])