app/controllers/classtimes_controller.rb

  def index
    @classtimes = Classtime.all
---
SELECT "classtimes".* FROM "classtimes"

  def create
    @classtime = Classtime.new(classtime_params)

    respond_to do |format|
      if @classtime.save
---
INSERT INTO "classtimes" ("VIPbalance", "balance", "created_at", "givenVIPtime", "lastClass", "name", "password", "takenTime", "takenVIPTime", "totalTime", "updated_at", "validDate") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @classtime.update(classtime_params)
---
UPDATE "classtimes" SET "name" = ?, "password" = ?, "totalTime" = ?, "takenTime" = ?, "givenVIPtime" = ?, "validDate" = ?, "updated_at" = ? WHERE "classtimes"."id" = 1  [["name", "Yang Shi"], ["password", "12"], ["totalTime", 10000], ["takenTime", 9000], ["givenVIPtime", ""], ["validDate", ""], ["updated_at", Thu, 13 Jun 2013 21:40:12 UTC +00:00]]

    def set_classtime
      @classtime = Classtime.find(params[:id])
---
SELECT "classtimes".* FROM "classtimes" WHERE "classtimes"."id" = ? LIMIT 1  [["id", "1"]]