app/controllers/pages_controller.rb

  def sisley
    name = params[:name]
    password = params[:password]
    if (name == "sisley" && password == "123")
      @u = User.all
      latest = Broadcast.order("created_at DESC")
---
SELECT "users".* FROM "users"
SELECT "broadcasts".* FROM "broadcasts" ORDER BY created_at DESC LIMIT 1

  def broadcast
    broadcast = params[:broadcast]
    Broadcast.create(:content => broadcast)
---
INSERT INTO "broadcasts" ("content", "created_at", "updated_at") VALUES (?, ?, ?)  [["content", "测试1"], ["created_at", Fri, 07 Jun 2013 17:57:00 UTC +00:00], ["updated_at", Fri, 07 Jun 2013 17:57:00 UTC +00:00]]

  def student
    name = params[:name]
    password = params[:password]
    @u = User.find_by_name(name)
    if (@u.password == password)
      latestBroadcast = Broadcast.order("created_at DESC")
      @broadcast = latestBroadcast.take(2)
      latestTopic = Topic.order("created_at DESC")
      @topic = latestTopic.take(20)
      @classTime = Classtime.find_by_name(name)
---
SELECT "users".* FROM "users" WHERE "users"."name" = '123' LIMIT 1
SELECT "broadcasts".* FROM "broadcasts" ORDER BY created_at DESC LIMIT 1
SELECT "classtimes".* FROM "classtimes" WHERE "classtimes"."name" = '时阳' LIMIT 1

  def resetClasstime
    Classtime.delete_all
---
DELETE FROM "classtimes"