app/controllers/topics_controller.rb

  def index
    @topics = Topic.all
---
SELECT "topics".* FROM "topics"

  def create
    @topic = Topic.new(topic_params)

    respond_to do |format|
      if @topic.save
---
INSERT INTO "topics" ("created_at", "day", "endTime", "homework", "month", "people", "preparation", "startTime", "theme", "updated_at", "year") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @topic.update(topic_params)
---
UPDATE "topics" SET "startTime" = ?, "endTime" = ?, "updated_at" = ? WHERE "topics"."id" = 1  [["startTime", "12:00"], ["endTime", "2:00"], ["updated_at", Thu, 13 Jun 2013 22:05:27 UTC +00:00]]

  def destroy
    @topic.destroy
---
DELETE FROM "topics" WHERE "topics"."id" = ?  [["id", 2]]

    def set_topic
      @topic = Topic.find(params[:id])
---
SELECT "topics".* FROM "topics" WHERE "topics"."id" = ? LIMIT 1  [["id", "2"]]