app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def search
    name = params[:name]
    @users = User.where("name = ?", name).select('*')
---
SELECT "users".* FROM "users" WHERE "users"."name" = 'Yang' LIMIT 1

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("course", "created_at", "name", "password", "updated_at") VALUES (?, ?, ?, ?, ?)  [["course", "123"], ["created_at", Mon, 03 Jun 2013 19:55:09 UTC +00:00], ["name", "123"], ["password", "123"], ["updated_at", Mon, 03 Jun 2013 19:55:09 UTC +00:00]]

  def update
    respond_to do |format|
      if @user.update(user_params)
---
UPDATE "users" SET "homeNum" = ?, "club" = ?, "address" = ?, "from" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["homeNum", "(010)6472-5386"], ["club", "搭网站小组"], ["address", "1915 Maple Ave"], ["from", "北京"], ["updated_at", Fri, 07 Jun 2013 16:55:51 UTC +00:00]]

  def destroy
    @user.destroy
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 2]]

  def set_user
    @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT 1  [["id", "2"]]